<a href="https://colab.research.google.com/github/bsrdrk/Pandas/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# PANDAS

## Series

In [31]:
import numpy as np
import pandas as pd

In [32]:
monthlist = ["January", "February", "March", "April", "May" , "June" , "July" , "August", "September", "October", "November", "December"]
numberlist = [1,2,3,4,5,6,7,8,9,10,11,12]

In [33]:
pd.Series(data = numberlist, index = monthlist)

January       1
February      2
March         3
April         4
May           5
June          6
July          7
August        8
September     9
October      10
November     11
December     12
dtype: int64

In [34]:
dayslist = ["Monday", "Tuesday", "Wednesday" ,"Thursday", "Friday", "Saturday", "Sunday"]

In [35]:
Array = np.array([1,2,3,4,5,6,7])
pd.Series(Array,dayslist)

Monday       1
Tuesday      2
Wednesday    3
Thursday     4
Friday       5
Saturday     6
Sunday       7
dtype: int64

We created numpy array above but if we want we can write both of them in pd.series(). Let's try!

In [36]:
pd.Series(data = np.array([0,1,2]), index = ["Apple", "Banana","Lemon"])

Apple     0
Banana    1
Lemon     2
dtype: int64

Also we can use dictionary.

In [37]:
dictionary = {"Busra" : 22 , "Oskar" : 2 , "Mehmet" : 21}
pd.Series(dictionary)

Busra     22
Oskar      2
Mehmet    21
dtype: int64

## Dataframes

### Create DataFrame

Dataframe is like a combination of series. It has columns and rows.

In [38]:
df = pd.DataFrame(data = np.random.randn(3,3), index = ["row1","row2","row3"] , columns = ["Column1", "Column2", "Column3"])
df

       Column1   Column2   Column3
row1 -0.571603 -0.435834  1.065320
row2  0.352307 -0.384771 -0.468828
row3  1.205694  1.248968  0.830319

**How we check a column ?**

In [39]:
df["Column1"]

row1   -0.571603
row2    0.352307
row3    1.205694
Name: Column1, dtype: float64

**How we check a row ?**

In [40]:
df.loc["row1"] # we can't write df["row1"]

Column1   -0.571603
Column2   -0.435834
Column3    1.065320
Name: row1, dtype: float64

In [41]:
df.iloc[0] #Also we can check like this 0:row1 , 1:row2 , 2:row3

Column1   -0.571603
Column2   -0.435834
Column3    1.065320
Name: row1, dtype: float64

**How we check more than one columns ?**

In [42]:
df[["Column1", "Column3"]]

       Column1   Column3
row1 -0.571603  1.065320
row2  0.352307 -0.468828
row3  1.205694  0.830319

**How we check a column and row together ?**

In [43]:
df.loc["row1", "Column3"]

1.0653195521109537

In [44]:
df.loc[["row1","row3"], ["Column2","Column3"],]

       Column2   Column3
row1 -0.435834  1.065320
row3  1.248968  0.830319

**How we add new columns ?**

In [45]:
df["Column4"]= pd.Series(np.random.randn(3), ["row1", "row2", "row3"])

In [46]:
df

       Column1   Column2   Column3   Column4
row1 -0.571603 -0.435834  1.065320  0.136015
row2  0.352307 -0.384771 -0.468828  0.690351
row3  1.205694  1.248968  0.830319 -0.341268

**NOTE:** If we do not write our indexes correctly, it will write "nan" in the part where that index is. For example if you write "a" instead of "row3" so column4 and  row3 will be nan.

How I can find sum of values ?

In [47]:
df["Sum"] = df["Column1"] + df["Column2"] + df["Column3"] + df["Column4"]
df

       Column1   Column2   Column3   Column4       Sum
row1 -0.571603 -0.435834  1.065320  0.136015  0.193897
row2  0.352307 -0.384771 -0.468828  0.690351  0.189059
row3  1.205694  1.248968  0.830319 -0.341268  2.943712

**How I can delete a column?**

We can delete indexes or columns. If you want to delete index , your axis should be 0 as default otherwise your axis should be 1.

In [48]:
df.drop("Sum" , axis = 1) #axis = 1 because of we want delete a column

       Column1   Column2   Column3   Column4
row1 -0.571603 -0.435834  1.065320  0.136015
row2  0.352307 -0.384771 -0.468828  0.690351
row3  1.205694  1.248968  0.830319 -0.341268

In [49]:
df

       Column1   Column2   Column3   Column4       Sum
row1 -0.571603 -0.435834  1.065320  0.136015  0.193897
row2  0.352307 -0.384771 -0.468828  0.690351  0.189059
row3  1.205694  1.248968  0.830319 -0.341268  2.943712

**I deleted but column still shows up, why ?**

Because df.drop has a parameter named "inplace", and it's default value is "False" so it doesn't delete actually but if we change to  "True" ,it will delete.

In [50]:
df.drop("Sum" , axis = 1, inplace=True)
df

       Column1   Column2   Column3   Column4
row1 -0.571603 -0.435834  1.065320  0.136015
row2  0.352307 -0.384771 -0.468828  0.690351
row3  1.205694  1.248968  0.830319 -0.341268

### DataFrame Filtering

In [51]:
array =np.arange(1,29)
array =array.reshape(4,7)
days = ["Monday", "Tuesday", "Wednesday" ,"Thursday", "Friday", "Saturday", "Sunday"]
weeks = ["1.week" , "2.week","3.week","4.week"]
df = pd.DataFrame(data = array , columns = days , index = weeks)
df

        Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
1.week       1        2          3         4       5         6       7
2.week       8        9         10        11      12        13      14
3.week      15       16         17        18      19        20      21
4.week      22       23         24        25      26        27      28

Let's find even days!

In [52]:
df[df%2 == 0]

        Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
1.week     NaN      2.0        NaN       4.0     NaN       6.0     NaN
2.week     8.0      NaN       10.0       NaN    12.0       NaN    14.0
3.week     NaN     16.0        NaN      18.0     NaN      20.0     NaN
4.week    22.0      NaN       24.0       NaN    26.0       NaN    28.0

Let's find the weeks that start with an odd number of days.

In [53]:
df[df["Monday"]%2 ==1]

        Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
1.week       1        2          3         4       5         6       7
3.week      15       16         17        18      19        20      21

Let's find 4. week!

In [54]:
df[df["Monday"]>=22]

        Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
4.week      22       23         24        25      26        27      28

**How can I use two conditions at the same time?**

We can use and (&) or or(|) conjunctions.

Let's check even mondays **and** tuesday which is smaller than 15th.

In [55]:
df[(df["Monday"]%2 == 0) & (df["Tuesday"]< 15)]

        Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
2.week       8        9         10        11      12        13      14

Let's check even mondays **or** tuesday which is smaller than 15th.

In [56]:
df[(df["Monday"]%2 == 0) | (df["Tuesday"]< 15)]

        Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
1.week       1        2          3         4       5         6       7
2.week       8        9         10        11      12        13      14
4.week      22       23         24        25      26        27      28

set_index("column which you want") = Set the DataFrame index using existing columns.

In [57]:
df.set_index("Sunday")

        Monday  Tuesday  Wednesday  Thursday  Friday  Saturday
Sunday
7            1        2          3         4       5         6
14           8        9         10        11      12        13
21          15       16         17        18      19        20
28          22       23         24        25      26        27

### Defining MultiIndex in Dataframes

Let's consider 3 bookstores.Let's create a dataframe that writes the number of sales of the 3 types of novels sold by these bookstores.

In [58]:
bookstores = ["Bookstores1","Bookstores1","Bookstores1","Bookstores2","Bookstores2","Bookstores2","Bookstores3","Bookstores3","Bookstores3"]
novelstype = ["Classics", "Fantasy" , "Horror","Classics", "Fantasy" , "Horror","Classics", "Fantasy" , "Horror"]
mylist = list(zip(bookstores , novelstype))
mylist = pd.MultiIndex.from_tuples(mylist)
mylist

MultiIndex([('Bookstores1', 'Classics'),
            ('Bookstores1',  'Fantasy'),
            ('Bookstores1',   'Horror'),
            ('Bookstores2', 'Classics'),
            ('Bookstores2',  'Fantasy'),
            ('Bookstores2',   'Horror'),
            ('Bookstores3', 'Classics'),
            ('Bookstores3',  'Fantasy'),
            ('Bookstores3',   'Horror')],
           )

In [59]:
df = pd.DataFrame(np.random.randint(1,100,27).reshape(9,3) , mylist ,columns=["April#ofsales","August#ofsales","December#ofsales"])

In [60]:
df

                      April#ofsales  August#ofsales  December#ofsales
Bookstores1 Classics             68              40                62
            Fantasy              38              93                20
            Horror                1              58                35
Bookstores2 Classics             68              26                25
            Fantasy              48              13                32
            Horror               26               4                68
Bookstores3 Classics             35              78                32
            Fantasy               3              63                49
            Horror               78              68                13

In [61]:
df["April#ofsales"]

Bookstores1  Classics    68
             Fantasy     38
             Horror       1
Bookstores2  Classics    68
             Fantasy     48
             Horror      26
Bookstores3  Classics    35
             Fantasy      3
             Horror      78
Name: April#ofsales, dtype: int64

In [62]:
df.loc["Bookstores2"]

          April#ofsales  August#ofsales  December#ofsales
Classics             68              26                25
Fantasy              48              13                32
Horror               26               4                68

In [63]:
df.loc[["Bookstores1", "Bookstores3"]]

                      April#ofsales  August#ofsales  December#ofsales
Bookstores1 Classics             68              40                62
            Fantasy              38              93                20
            Horror                1              58                35
Bookstores3 Classics             35              78                32
            Fantasy               3              63                49
            Horror               78              68                13

In [64]:
df.loc["Bookstores1"].loc["Classics"]

April#ofsales       68
August#ofsales      40
December#ofsales    62
Name: Classics, dtype: int64

In [65]:
df.index.names

FrozenList([None, None])

In [66]:
df.index.names = ["Bookstores", "Types"]

In [67]:
df

                      April#ofsales  August#ofsales  December#ofsales
Bookstores  Types
Bookstores1 Classics             68              40                62
            Fantasy              38              93                20
            Horror                1              58                35
Bookstores2 Classics             68              26                25
            Fantasy              48              13                32
            Horror               26               4                68
Bookstores3 Classics             35              78                32
            Fantasy               3              63                49
            Horror               78              68                13

In [68]:
df.xs("Bookstores1") # This is same with df.loc["Bookstores1"]

          April#ofsales  August#ofsales  December#ofsales
Types
Classics             68              40                62
Fantasy              38              93                20
Horror                1              58                35

What I only check horror in all bookstores ?

In [69]:
df.xs("Horror", level = "Types")

             April#ofsales  August#ofsales  December#ofsales
Bookstores
Bookstores1              1              58                35
Bookstores2             26               4                68
Bookstores3             78              68                13

### Lost and Broken Datas

In [70]:
arr = np.array([[10 , 20 , np.nan],[30 , np.nan , np.nan],[40,np.nan ,60]])
arr

array([[10., 20., nan],
       [30., nan, nan],
       [40., nan, 60.]])

In [71]:
df = pd.DataFrame(arr , index = ["Index1", "Index2", "Index3"] , columns = ["Column1", "Column2","Column3"])
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2     30.0      NaN      NaN
Index3     40.0      NaN     60.0

dropna() is a function which delete nans.If axis = 0 it delete indexes, if axis = 1 it delete columns. Default of axis is 0. Also it has inplace parameter (default is False), if you want to change your df , you sould change to True. But delete all index or column is not the correct way. We can use "thresh" parameter. For example we say thresh = 2 , it means if there is at least two value except nan don't delete index or columns.

In [72]:
df.dropna() # axis = 0

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [73]:
df.dropna(axis = 1)

        Column1
Index1     10.0
Index2     30.0
Index3     40.0

In [74]:
df.dropna(thresh = 2)

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index3     40.0      NaN     60.0

fillna() is a function which fill nans. "value" is a parameter of this function and it writes your value instead of nan.

In [75]:
df.fillna(value = 1)

        Column1  Column2  Column3
Index1     10.0     20.0      1.0
Index2     30.0      1.0      1.0
Index3     40.0      1.0     60.0

But giving a value is not perfect way. We generally use mean of values.

In [76]:
df.sum().sum()

160.0

In [77]:
df.size

9

In [78]:
df.isnull().sum().sum() # it returns nan value sum

4

In [79]:
def calculatemean(df):
  totalSum = df.sum().sum()
  totalNum = df.size -df.isnull().sum().sum()
  return totalSum / totalNum

In [80]:
df.fillna(value=calculatemean(df), inplace =True)

### Queries

**GroupBy Queries**

I created a little school dataset.

In [81]:
dataset = {
    "Lesson" : ["Math" , "English" , "English" , "Science" , "Math" , "Science"],
    "Student" : ["Josh" , "Maria" , "Robin", "Lauren", "Tom", "Becky"],
    "Score" : [60,70,68,54,48,92]
}

In [82]:
df = pd.DataFrame(dataset)
df

    Lesson Student  Score
0     Math    Josh     60
1  English   Maria     70
2  English   Robin     68
3  Science  Lauren     54
4     Math     Tom     48
5  Science   Becky     92

In [83]:
LessonGroup = df.groupby("Lesson")

Let's find mean of scores.

In [84]:
LessonGroup.mean()

         Score
Lesson
English     69
Math        54
Science     73

In [85]:
int(LessonGroup.mean().loc["English"])

69

In [86]:
LessonGroup.count()

         Student  Score
Lesson
English        2      2
Math           2      2
Science        2      2

English Lesson has 2 students and scores. It shows this.

In [87]:
LessonGroup.max()

        Student  Score
Lesson
English   Robin     70
Math        Tom     60
Science  Lauren     92

In [88]:
LessonGroup.min()["Score"]["Science"]

54

**Concatenation**

In [89]:
dataset1 = {
    "A" : ["A1", "A2","A3","A4"],
    "B" : ["B1","B2", "B3", "B4"],
    "C" : ["C1" , "C2", "C3", "C4"],
} 
dataset2 = {
    "A" : ["A5", "A6","A7","A8"],
    "B" : ["B5","B6", "B7", "B8"],
    "C" : ["C5" , "C6", "C7", "C8"],
} 
df1 = pd.DataFrame(dataset1 , index = [1,2,3,4])
df2 = pd.DataFrame(dataset2 , index =[5,6,7,8])

In [90]:
df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

In [91]:
df2

    A   B   C
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [92]:
pd.concat([df1,df2]) #axis = 0

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

**Join**

In [93]:
dataset1 = {
    "A" : ["A1", "A2","A3","A4"],
    "B" : ["B1","B2", "B3", "B4"],
} 
dataset2 = {
    "X" : ["X1", "X2","X3"],
    "Y" : ["Y1","Y2", "Y3"],
} 
df1 = pd.DataFrame(dataset1 , index = [1,2,3,4])
df2 = pd.DataFrame(dataset2 , index =[1,2,3])

In [94]:
df1

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [95]:
df2

    X   Y
1  X1  Y1
2  X2  Y2
3  X3  Y3

In [96]:
df1.join(df2)

    A   B    X    Y
1  A1  B1   X1   Y1
2  A2  B2   X2   Y2
3  A3  B3   X3   Y3
4  A4  B4  NaN  NaN

In [97]:
df2.join(df1) # it makes left join in sql but we can change as how = 'right'

    X   Y   A   B
1  X1  Y1  A1  B1
2  X2  Y2  A2  B2
3  X3  Y3  A3  B3

**Merge**

In [98]:
dataset1 = {
    "A" : ["A1", "A2","A3"],
    "B" : ["B1","B2", "B3"],
    "key" : ["K1","K2","K3"]
} 
dataset2 = {
    "X" : ["X1", "X2","X3","X4"],
    "Y" : ["Y1","Y2", "Y3","Y4"],
    "key" : ["K1","K2","K5","K4"]
} 
df1 = pd.DataFrame(dataset1 , index = [1,2,3])
df2 = pd.DataFrame(dataset2 , index =[1,2,3,4])

In [99]:
df1

    A   B key
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [100]:
df2

    X   Y key
1  X1  Y1  K1
2  X2  Y2  K2
3  X3  Y3  K5
4  X4  Y4  K4

In [101]:
#it is kind of inner join
pd.merge(df1,df2, on = "key")

    A   B key   X   Y
0  A1  B1  K1  X1  Y1
1  A2  B2  K2  X2  Y2

### Operations in Pandas

In [102]:
df = pd.DataFrame({
    "Column1" : [1,2,3,4,5,6],
    "Column2" : [100,200,300,100,300,200],
    "Column3" : ["A", "B", "C", "D", "E", "F"]
})
df

   Column1  Column2 Column3
0        1      100       A
1        2      200       B
2        3      300       C
3        4      100       D
4        5      300       E
5        6      200       F

We use head() function to see the first five values.

In [103]:
df.head()

   Column1  Column2 Column3
0        1      100       A
1        2      200       B
2        3      300       C
3        4      100       D
4        5      300       E

5 is default value. If we want to see more we can send parameter.

In [104]:
df.head(6)

   Column1  Column2 Column3
0        1      100       A
1        2      200       B
2        3      300       C
3        4      100       D
4        5      300       E
5        6      200       F

If we want to see which values we have , we can use unique().

In [105]:
df["Column2"].unique() # Returns Column2's uniques

array([100, 200, 300])

We find uniques but If we wonder how many uniques we have, we can use value_counts().

In [106]:
df["Column2"].value_counts()

100    2
300    2
200    2
Name: Column2, dtype: int64

In [107]:
df[(df["Column1"]>=4)]

   Column1  Column2 Column3
3        4      100       D
4        5      300       E
5        6      200       F

**How are all values in a column passed to a function?**

In [108]:
def multiply(x):
  return x*3

In [109]:
df["Column2"] =df["Column2"].apply(multiply)

In [110]:
df

   Column1  Column2 Column3
0        1      300       A
1        2      600       B
2        3      900       C
3        4      300       D
4        5      900       E
5        6      600       F

In [111]:
sumfunc = lambda x : x+100

In [112]:
df["Column2"] = df["Column2"].apply(sumfunc)
df

   Column1  Column2 Column3
0        1      400       A
1        2      700       B
2        3     1000       C
3        4      400       D
4        5     1000       E
5        6      700       F

In [113]:
df["Column3"].apply(len) #also we can call python function

0    1
1    1
2    1
3    1
4    1
5    1
Name: Column3, dtype: int64

In [114]:
df.columns

Index(['Column1', 'Column2', 'Column3'], dtype='object')

In [115]:
df.index

RangeIndex(start=0, stop=6, step=1)

**How many index I have ?**

In [116]:
len(df.index)

6

**If we want to sort by another column how we can do ?**

In [117]:
df.sort_values("Column2") # if you want to change df you should use inplace

   Column1  Column2 Column3
0        1      400       A
3        4      400       D
1        2      700       B
5        6      700       F
2        3     1000       C
4        5     1000       E

**What if I want to sort reverse order ?**

In [118]:
df.sort_values("Column2", ascending= False)

   Column1  Column2 Column3
2        3     1000       C
4        5     1000       E
1        2      700       B
5        6      700       F
0        1      400       A
3        4      400       D